# HideReferencePlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..HideReferencePlane Property
BaseExportOptions Class See Also
---
Whether or not to hide reference planes. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HideReferencePlane { get; set; }
```

Visual Basic
---
```text
Public Property HideReferencePlane As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideReferencePlane {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace